/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   find_unique_paths.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rschuppe <rschuppe@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/20 19:11:32 by rschuppe          #+#    #+#             */
/*   Updated: 2019/02/20 19:19:19 by rschuppe         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "lem_in.h"

/*
**	Получает максимальное количество необходимых уникальных маршрутов
*/

int	get_max_count_need_unique_paths(int8_t **incidence)
{
	return (1);
}

/*
**	Находит комбинации уникальных (не пересекающихся) маршрутов
*/

int	***find_unique_paths(int count)
{
	return (NULL);
}