/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   find_best_comb_paths.c                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rschuppe <rschuppe@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/20 19:21:05 by rschuppe          #+#    #+#             */
/*   Updated: 2019/02/20 19:28:30 by rschuppe         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "lem_in.h"

/*
**	Выбор оптимальной комбинации путей для заданного числа муравьев
*/

int	**find_best_comb_paths(int ***path_combs, int ants_count)
{
	return (NULL);
}